# BasepointLongitudeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BasepointLongitudeParam Property
ParameterTypeId Class See Also
---
"Lon"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BasepointLongitudeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BasepointLongitudeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BasepointLongitudeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace